rythmn1111/verifiable_wallet/sdkconfig.defaults
# ESP32-S3-Touch-LCD-3.5 (Waveshare) - from board_examples
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16MB, QIO, 80 MHz
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Custom partition table (same as board_examples)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# CPU 240 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# PSRAM: 8MB OCT, 80 MHz (board uses GPIO26 CS, GPIO30 CLK)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_CLK_IO=30
CONFIG_SPIRAM_CS_IO=26

# LVGL (for QR scan UI)
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_USE_LOG=n

# TLS: allow skip server cert verify if no other option set (for HTTPS e.g. CoinGecko)
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# CA certificate bundle for proper HTTPS verification (CoinGecko etc.)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
